# Core shell
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "moreutils"
brew "binutils"
brew "diffutils"
brew "gnu-tar"
brew "grep"

# Version control
brew "git"
brew "git-lfs"
brew "gh"

# Editors
brew "neovim"
brew "vim"

# Search and navigation
brew "fzf"
brew "ripgrep"
brew "fd"

# Viewers and formatters
brew "bat"
brew "jq"
brew "less"
brew "tree"

# Shell tooling
brew "shellcheck"
brew "shfmt"
brew "direnv"

# Networking
brew "ca-certificates"
brew "curl"
brew "wget"
brew "nmap"
brew "openssh"
brew "socat"

# Encryption
brew "gnupg"
brew "gnutls"
brew "openssl"

# Multiplexers
brew "tmux"
brew "screen"

# Misc
brew "htop"
